//=============================================================================
//
// ゲーム画面処理 [gameSky.h]
// Author : 熊澤義弘
//
//=============================================================================
#pragma once


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitGameSky(void);
void UninitGameSky(void);
void UpdateGameSky(void);
void DrawGameSky(void);

BOOL GetParticalSwicth(void);

