//=============================================================================
//
// モデル処理 [Tako.h]
// Author : 
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_TAKO		(3)					// プレイヤーの数
#define	TAKO_SIZE		(5.0f)				// 当たり判定の大きさ


//*****************************************************************************
// 構造体定義
//*****************************************************************************
enum
{
	ZUZHO,
	CATCH,
	RELEASE,
	WAIT
};



struct TAKO
{
	XMFLOAT3		pos;		// ポリゴンの位置
	XMFLOAT3		rot;		// ポリゴンの向き(回転)
	XMFLOAT3		scl;		// ポリゴンの大きさ(スケール)

	XMFLOAT4X4		mtxWorld;	// ワールドマトリックス

	BOOL			load;
	DX11_MODEL		model;		// モデル情報

	float			angle;
	float			spd;		// 移動スピード
	float			dir;		// 向き
	float			size;		// 当たり判定の大きさ
	int				shadowIdx;	// 影のIndex
	BOOL			use;

	int				mode;


};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTako(void);
void UninitTako(void);
void UpdateTako(void);
void DrawTako(void);

TAKO *GetTako(void);
void SetTako(void);

