//=============================================================================
//
// ターゲット用の空オブジェクト処理 [targetObj.h]
// Author : 熊澤
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_TARGETOBJ	(1)						// 数
#define TARGET_MOVE_VALUE_Y			(5.0f)		// ターゲットが縦に動く速度
#define TARGET_MOVE_VALUE_X			(0.02f)		// ターゲットが横に動く速度

enum {
	up,
	down,
	right,
	left,
};

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct TARGETOBJ
{
	XMFLOAT4X4			mtxWorld;			// ワールドマトリックス
	XMFLOAT3			pos;				// モデルの位置
	XMFLOAT3			rot;				// モデルの向き(回転)
	XMFLOAT3			scl;				// モデルの大きさ(スケール)

	BOOL				load;
	DX11_MODEL			model;				// モデル情報
	XMFLOAT4			diffuse[MODEL_MAX_MATERIAL];	// モデルの色
	
	BOOL				use;				// 使うかどうか
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTargetObj(void);
void UninitTargetObj(void);
void UpdateTargetObj(void);
void DrawTargetObj(void);

TARGETOBJ *GetTargetObj(void);

