//=============================================================================
//
// タイミングテキストの処理 [timingtext.h]
// Author : 熊澤義弘
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TTEXT_MAX		(5)		// タイミングテキストの最大数



// 音符の構造体
struct TIMINGTEXT
{
	XMFLOAT2	pos;
	BOOL		use;
	int			texNum;
	int			life;
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTimingText(void);
void UninitTimingText(void);
void UpdateTimingText(void);
void DrawTimingText(void);

void SetTimingText(int text);

void SetNoteMove(float onpu_speed);
